example = 'pycharm' # присваивам строковой переменную
print ('В слове=', example) # вывадим на эеран это слово
print ('первая буква= ', example[0]) # выводим на экран первую букву используя индекс 0
print ('последняя буква=' , example[-1] ) # выводимнна экранпоследнююбукву используя индекс -1
print ('вторая потловина слова =', example[4:]) # вторая половинаслова с начальным индексом 4 и пустым вторым
print('слово наоборот=', example[::-1]) # слово наоборот через 2 пустых индекса и обратным шагом